import { Component } from '@angular/core';
import { Router } from '@angular/router';

@Component({
  selector: 'app-start',
  templateUrl: './start.component.html',
  styleUrls: ['./start.component.scss']
})
export class StartComponent  {

    //-----------------------------------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------Методы стартовой страницы-----------------------------------------------------------------

  constructor(private route: Router // для работы с роутингом
    ) { }

    //-----------------------------------------------Метод перехода к логин форме--------------------------------------------------------------
  MoveToLogin(){
    this.route.navigate(['/login']); //перенаправляем на login
  }
    //-----------------------------------------------Метод перехода к курсам--------------------------------------------------------------------
  MoveToCourses(){
    this.route.navigate(['/courses']); //перенаправляем на courses
  }


}
